class FAQEntity {
  final String question;
  final String answer;

  FAQEntity({required this.question, required this.answer});

  static List<FAQEntity> faqList = [
    FAQEntity(
      question: "إيه هو تطبيق In Egypt؟",
      answer:
          "تطبيق سياحي بيساعدك تكتشف أهم الأماكن السياحية والأثرية في مصر، مع تفاصيل، صور، وموقع على الخريطة.",
    ),
    FAQEntity(
      question: "إزاي أقدر أعمل حساب جديد؟",
      answer:
          "من صفحة البداية دوس على 'إنشاء حساب'، واملا البيانات المطلوبة زي الاسم، الإيميل، والباسورد.",
    ),
    FAQEntity(
      question: "ممكن أستخدم التطبيق من غير ما أعمل حساب؟",
      answer:
          "آه، تقدر تتصفح الأماكن، لكن بعض المميزات زي إضافة أماكن للمفضلة أو كتابة تقييم هتحتاج حساب.",
    ),
    FAQEntity(
      question: "إزاي أسجّل دخول؟",
      answer: "من صفحة البداية دوس على 'تسجيل دخول'، وادخل إيميلك والباسورد.",
    ),
    FAQEntity(
      question: "نسيت الباسورد، أعمل إيه؟",
      answer:
          "دوس على 'نسيت كلمة المرور'، واكتب إيميلك وهيجيلك لينك لإعادة التعيين.",
    ),
    FAQEntity(
      question: "ممكن أفتح موقع المكان على خرائط جوجل؟",
      answer: "آة. من صفحة تفاصيل المكان يوجد خانة'موقع المكان'.",
    ),
    FAQEntity(
      question: "هل التطبيق مجاني؟",
      answer:
          "أيوه، التطبيق مجاني بالكامل، وممكن يكون فيه بعض الخدمات المستقبلية المدفوعة.",
    ),
    FAQEntity(
      question: "إزاي أضيف مكان لقائمة المفضلة؟",
      answer:
          "من صفحة تفاصيل المكان دوس على أيقونة القلب ❤️ وهتلاقيه في صفحة المفضلة بعد كده.",
    ),
    FAQEntity(
      question: "ممكن أكتب رأيي أو تقييم عن مكان؟",
      answer: "آه، ادخل على تفاصيل المكان وهتلاقي خانة التقييم والتعليقات.",
    ),
    FAQEntity(
      question: "هل الأماكن المعروضة في التطبيق محدثة باستمرار؟",
      answer:
          "أيوه، إحنا بنحدث قاعدة البيانات بشكل دوري علشان نضيف أماكن جديدة ونراجع القديمة.",
    ),
    FAQEntity(
      question: "إزاي أقدر أبحث عن مكان معين؟",
      answer:
          "من شريط البحث في الصفحة الرئيسية، اكتب اسم المكان أو نوعه (زي متحف، مطعم، معبد).",
    ),
    FAQEntity(
      question: "ممكن أشوف صور الأماكن قبل ما أروح؟",
      answer:
          "طبعًا، كل مكان بيحتوي على معرض صور علشان تاخد فكرة قبل ما تزوره.",
    ),
    FAQEntity(
      question: "التطبيق شغال بالإنترنت بس؟",
      answer:
          "حاليًا لازم إنترنت علشان البيانات تتسحب من السيرفر، لكن بنجهز خاصية offline قريب.",
    ),
    FAQEntity(
      question: "هل التطبيق بيغطي كل مدن مصر ولا القاهرة بس؟",
      answer:
          "التطبيق بيغطي معظم المدن السياحية في مصر زي القاهرة، الأقصر، أسوان، الإسكندرية، وسيناء.",
    ),
    FAQEntity(
      question: "هل التطبيق بيشتغل على الآيفون كمان ولا بس أندرويد؟",
      answer: "التطبيق متاح على أندرويد وiOS.",
    ),
    FAQEntity(
      question: "التطبيق آمن على بياناتي الشخصية؟",
      answer: "أيوه، بياناتك محمية ومش بنشاركها مع أي طرف تالت.",
    ),
  ];
}
